In [1]:
import pandas as pd

In [5]:
var=pd.DataFrame({'days':[1,2,3,4],'eng':[10,12,13,14],'maths':[17,18,19,20]})
var

   days  eng  maths
0     1   10     17
1     2   12     18
2     3   13     19
3     4   14     20

In [6]:
pd.melt(var,id_vars=['days'])

   days variable  value
0     1      eng     10
1     2      eng     12
2     3      eng     13
3     4      eng     14
4     1    maths     17
5     2    maths     18
6     3    maths     19
7     4    maths     20

In [16]:
# Create a simple dataframe 

# importing pandas as pd 
import pandas as pd 

# creating a dataframe 
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'], 
	'B': ['Masters', 'Graduate', 'Graduate'], 
	'C': [27, 23, 21]}) 

df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [17]:
# values can be an object or a list 
df.pivot(index='A',columns='B',values='C')

B     Graduate  Masters
A
Boby      23.0      NaN
John       NaN     27.0
Mina      21.0      NaN

In [10]:
df = pd.DataFrame({
    'Date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    'Category': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 30, 15]
})

pivoted = df.pivot(index='Date', columns='Category', values='Value')
pivoted

Category     A   B
Date
2022-01-01  10  20
2022-01-02  30  15

In [18]:
var=pd.DataFrame({'A':[1],'B':[2],'c':[2]})
var

   A  B  c
0  1  2  2

In [19]:
var['d']=4

In [20]:
var

   A  B  c  d
0  1  2  2  4

In [23]:
var.insert(1,"d",5)

ValueError: cannot insert d, already exists

In [22]:
var

   A  D  B  c  d
0  1  5  2  2  4

In [41]:
pd.concat([var,pd.Series([6,6,6,6,6,6])],axis=1)

     A    D    B    c    d  0
0  1.0  5.0  2.0  2.0  4.0  6
1  NaN  NaN  NaN  NaN  NaN  6
2  NaN  NaN  NaN  NaN  NaN  6
3  NaN  NaN  NaN  NaN  NaN  6
4  NaN  NaN  NaN  NaN  NaN  6
5  NaN  NaN  NaN  NaN  NaN  6

### pivot table

In [42]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [43]:
table=df.pivot_table(values='D',index=['A','B'],columns='C',aggfunc='sum')
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [44]:
table=df.pivot_table(values='D',index=['A','B'],columns='C',aggfunc='sum',fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [46]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                        aggfunc={'D': "mean", 'E': "mean"})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

In [47]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                      aggfunc={'D': "mean",
                              'E': ["min", "max", "mean"]})

In [48]:
table

                  D   E
               mean max      mean min
A   C
bar large  5.500000   9  7.500000   6
    small  5.500000   9  8.500000   8
foo large  2.000000   5  4.500000   4
    small  2.333333   6  4.333333   2

In [1]:
# var=pd.DataFrame({'A':[45,3,34,42,42,23,12,12,23,45,34,64,33,22,44,55,66,77,88,11,22,33,11,12]})

# var_sorted_desc = var.sort_values(by='A', ascending=False)

# var_sorted_desc.replace('Hi',except_first=True)